In [1]:
import pandas as pd
df1 = pd.DataFrame({
    'City' : ['New York', 'Chicago', 'Orlando'],
    'Temperature': [21, 14, 35]
})
df1

       City  Temperature
0  New York           21
1   Chicago           14
2   Orlando           35

In [4]:
df2 = pd.DataFrame({
    'City' : ['Chicago', 'New York', 'Orlando'],
    'Humidity' : [65, 68, 75]
})
df2

       City  Humidity
0   Chicago        65
1  New York        68
2   Orlando        75

In [8]:
# Using 'merge' to merge two dataframes
df3 = pd.merge(df1,df2, on='City')
df3

       City  Temperature  Humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75